thesis.tex
% Created 2016-03-16 Wed 18:29
\documentclass[a4paper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage[hidelinks]{hyperref}
\tolerance=1000
\usepackage{minted}
\usepackage{todonotes}
\author{Nathanael Schweers}
\date{\today}
\title{Proof of Concept: An implementation of a reader for extensible syntaxes for Emacs Lisp}
\hypersetup{
 pdfauthor={Nathanael Schweers},
 pdftitle={Proof of Concept: An implementation of a reader for extensible syntaxes for Emacs Lisp},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.0.92.1 (Org mode 8.3.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\begin{abstract}
This thesis discusses the design and implementation of a proof of concept for
an Emacs Lisp compatible reader for extensible syntaxes, in Emacs Lisp.  In Lisp
parlance, the reader is the part of the interpreter/compiler, which converts
the characters in the source code to data structures, which are then further
processed.  In an extensible reader, new syntactic constructs may be defined.
These new constructs take effect when specific characters are encountered in
the source code, and may interact with the existing reader to create arbitrary
data structures which are later either interpreted or compiled by the Lisp
environment.

Some other languages feature such capabilities, of which Common Lisp is most
widely known.  Some Scheme implementations also provide these or similar
possibilities, yet this is not part of the standard.  SRFI-10 provides a
specific character sequence with which all read macros must start.
\todo{Provide a reference to SRFI-10 (see References tree)}

In Common Lisp the possibility to interact with the reader is called a read macro or
reader macro, and this term will also be used throughout this thesis.

Emacs Lisp does not provide reader macros.  As of the upcoming version 25.1 the
reader is implemented in C and does not provide any hooks into it, apart from
the usual advice system, which all Emacs Lisp functions provide.

The code underlying this thesis provides a means to replace the reader built
into Emacs.  The main point of this thesis is to show that the flexible nature
of a Lisp environment may be used to replace even such a crucial part of the
system as the reader at runtime, without affecting unrelated parts, or making
the original part unavailable.
\end{abstract}

\section{Ideas}
\label{sec:orgheadline6}
\subsection{Basics: What does a reader do?}
\label{sec:orgheadline3}
\subsubsection{Read simple syntax (lists, symbols, strings, etc) (mention atoms?)}
\label{sec:orgheadline1}
\subsubsection{Read more complex structures (quote, function)}
\label{sec:orgheadline2}
\subsection{How do read macros work?}
\label{sec:orgheadline4}
\subsection{How do read macros look?}
\label{sec:orgheadline5}

\section{Introduction}
\label{sec:orgheadline7}
In this thesis, the author wishes to first convey how Lisps syntax is different
from other languages and why this is relevant to the discussion of extending the
syntax.  Secondly what is meant by an extensible syntax or read macro, and why
they might be relevant.  Also, depending on the background of the reader of this
text, one might confuse such syntactic extensions with Domain Specific
Languages—or DSLs for short.

While there is some overlap between the two, DSLs are not necessarily embedded,
but instead may come with a separate compiler and/or interpreter.  An extensible
syntax, as it is presented here, allows to change the syntax on-the-fly,
possibly without altering any present syntactic constructs, thus allowing new
constructs in an existing programming language.
