thesis.org
* Motivation
  :PROPERTIES:
  :CUSTOM_ID: Motivation
  :END:
Users of other Lisp dialects, {{{cl}}} comes to mind, for a long time have
enjoyed the possibility to extend the syntax they use to write programs.  This
possibility provides a huge benefit in the course of evolving a language.
Macros---which are expanded at compile-time---provide a very powerful
mechanism.  These allow to control the order of evaluation of forms within the
macro, as well as the opportunity to transform them, yet sometimes even this
kind of power is not quite enough.

A very simple case, is the addition of syntax for data structures.  Most modern
programming languages provide some syntax to enter hash tables.  Take for
instance python, where the keys and values may be specified between curly
braces: 

#+BEGIN_SRC python
  {"foo": "bar", "five": 5}
#+END_SRC

When entered into a python interpreter, this expression returns a hash table (or
Dictionary in Python terminology).

Clojure, a rather recent addition to the Lisp family of languages also features
a similar syntax: 

#+BEGIN_SRC clojure
  {"foo" "bar" "five" 5}
#+END_SRC

This also returns a mapping from keys to values.

Unfortunately, neither {{{cl}}} nor {{{el}}} feature such (concise) syntax[fn::
{{{el}}} has read (and even print) syntax for hash tables, yet is is rather
ugly.  The same table looks like this: #s(hash-table size 65 test eql
rehash-size 1.5 rehash-threshold 0.8 data ("foo" "bar" "five" 5))].
{{{cl}}} users may create such a syntax themselves, yet {{{el}}} users never had
this possibility.

One shortcut which is possible, is to simply define a function to do so;
consider the function {{{fun(ht)}}} from the source code of this thesis, ported
to {{{cl}}}:

#+BEGIN_SRC common-lisp
  (defun ht (&rest args)
    "Create and return a hashtable.

  Keys and values are given alternating in args."
    (let ((h (make-hash-table)))
      (loop for (key value) on args by #'cddr
         do (if (and key value)
                (setf (gethash key h) value)
                (error "Odd number of arguments passed")))
      h))
#+END_SRC

This may be now used as:

#+BEGIN_SRC common-lisp
  (ht "foo" "bar" "five" 5)
#+END_SRC

instead of the more cumbersome

#+BEGIN_SRC common-lisp
  (let ((h (make-hash-table)))
    (prog1 h
      (setf (gethash "foo" h) "bar")
      (setf (gethash "five" h) 5)))
#+END_SRC

To further shorten and clarify the creation of hash tables, {{{cl}}} users may
use a read macro (assuming {{{fun(ht)}}} has been defined as above)[fn:: The
details of this code are not of particular importance, merely that it is
possible, and quite short.]:

#+BEGIN_SRC common-lisp
  (set-macro-character #\} (get-macro-character #\)))

  (set-macro-character
   #\{
   (lambda (stream char)
     (declare (ignore char))
     (apply #'ht (read-delimited-list #\} stream t))))
#+END_SRC

Now the {{{cl}}} reader reads "{...}" constructs in a similar fashion as the
Clojure reader does.

Given the code from this thesis, this code may be used in {{{el}}} to produce
the same effect:

#+BEGIN_SRC emacs-lisp
  (defun ht (&rest args)
    "Create and return a hashtable.

  Keys and values are given alternating in args."
    (let ((h (make-hash-table)))
      (cl-loop for (key value) on args by #'cddr
               do (if (and key value) (puthash key value h)
                    (error "Odd number of arguments passed")))
      h))

  (el-reader/set-macro-character ?\} (car (el-reader/get-macro-character ?\))))

  (el-reader/set-macro-character
   ?\{
   (lambda (stream char)
     (apply #'ht (el-reader/read-delimited-list ?\} stream t))))
#+END_SRC

Note the similarity of the API.  The prefixes have been put in place, as
{{{el}}} provides no packaging facilities.[fn:: Should Emacs change the internal
representation of symbols, packaging may be worthwhile, given this reader.]

A more sophisticated use case might be to provide read syntax for regular
expressions---or regexps for short.  In {{{el}}} regexps are notoriously ugly to
enter and read, because they are opaque strings, which are passed to a function,
which parses it at runtime.  This means that many constructs must be escaped
multiple times, which makes the strings difficult to read and write.  Here again
Clojure shows a nice way to handle the issue: by providing syntax for them.  In
Clojure, a regexp is entered by prefixing a double quoted string with a #
character.

While Clojure provides more syntax than {{{cl}}} and {{{el}}} do, it provides no
way for users to add their own shortcuts.

* Reader basics
See also: [[#Motivation][Motivation]]
** Properties of Lisp Syntax
The idea behind the syntax of Lisp is very different than in most other
programming languages.  While most languages provide constructs for assignment,
looping, function definition, etc, Lisp merely provides syntax for data
structures.  This idea has been reused in data description languages such as XML
and JSON, among others.  An expression in source form, which describes a Lisp
object is also called a symbolic expression, or sexp for short.  The term form
is also used on occasion.

So far, no evaluation rules have been discussed, and rightly so.  The evaluation
of code is not something the reader takes part in.  This is left to the
interpreter or the compiler.

** Intermezzo: syntax at runtime
While some programming environments allow the user to load code at runtime, Lisp
also allows to read and compile code at runtime.  The former is exposed by a
function called {{{fun(read)}}}.  This function is given at least one argument:
something which may be used to retrieve a character, and to put back at least
one character which has been read.  This function attempts to read one Lisp
object from the character stream, and returns said object if successful.

This aspect may be compared to an XML parser, which also merely describes data.
One difference is that a Lisp reader can be more flexible, as this thesis shows.
A further difference is that standard Lisp syntax[fn:: Standard syntax refers to
the set of rules present when no modification has taken place since a fresh
start of the environment.] is shorter when a lot of markup is needed.
I.e. writing programs in XML tends to be rather verbose, as such languages as ant
\todo{Place some ref here.} show.  Writing a document in symbolic expressions
would probably be rather cumbersome, as either lots of strings must be used, or
elaborate rules for the treatment of special chars as apostrophes must be devised.

