thesis.org
** COMMENT Properties of Lisp Syntax
So far, it is not clear how these structures are to be interpreted, as they are
merely data.  How these structures are to be interpreted depends on the dialect
of Lisp.  So far, it is not specified how to, say, define a function.  Different
Lisps do this differently ({{{el}}} and {{{cl}}} use a list starting with the
symbol {{{fun(defun)}}}, Scheme uses {{{fun(define)}}}, Clojure uses
{{{fun(defn)}}}.

What the read data structures mean, when treated as a program, is up to the Lisp
environment.  For instance, different Lisps may have different scoping rules:
Scheme is lexically scoped, {{{cl}}} has lexical scoping by default, and
supports so-called special variables, which have dynamic scope[fn:: Actually
indefinite scope and dynamic extent, yet mostly called dynamic scope.  This text
also uses the term dynamic scope.], while {{{el}}} until recently only had
dynamic scope.  Lexical scope is now available in {{{el}}}, yet must be manually
activated.  The intricacies of mixed scoping rules are beyond the scope of this
text.

#+BEGIN_COMMENT

Lisps syntax is different than the syntax for most programming languages,
because Lisps syntax does not describe control-flow in any way.  Lisp provides
syntax for data structures such as numbers, strings, lists and symbols.  In this
respect, Lisp embodies an idea later reinvented in the form of XML.  XML
provides means to describe a tree structure, yet makes no mention of how the
elements are to be interpreted.

In Lisp, the source code of a program is at first merely syntax for such
structures as lists, symbols, etc.  The evaluator (i.e. the interpreter or
compiler) assigns meaning to these structures and their context.

#+END_COMMENT

Consider the following example:

#+BEGIN_SRC emacs-lisp
  (foo (bar spam) with eggs)
#+END_SRC

Given only this code, it is very unclear what the meaning shall be.  This
becomes transparent when converted to XML:

#+BEGIN_SRC xml
  <foo>
    <bar>
      spam
    </bar>
    with eggs
  </foo>
#+END_SRC

Given only the XML snippet, it is unclear whether or not this describes a parse
tree from a programming language, in which for the code to be valid,
{{{fun(foo)}}} and {{{fun(bar)}}} must be functions, or operators.  Also, it is
unclear how evaluation shall proceed; {{{sym(spam)}}}, {{{sym(bar)}}} and
{{{sym(eggs)}}} might be evaluated in a strict or non-strict fashion.  Also,
error handling is not specified.  The tree may as well not be source code, but a
description of GUI elements in a parent-child relationship.

In Lisp the reader transforms the characters into a data structure (in this case
a list containing other lists and symbols).  This structure may be used by a
program directly, or may be passed to the evaluator.

This is important for at least three reasons: together with the printer it
enables easy serialization of in memory structures (as it is available at
runtime, as a regular function), it enables macros, which run at compile-time to
transform a tree into a different tree (which in turn may be compiled), and read
macros, the implementation of which is the topic of this thesis.

** Important Lisp Data Types
# Before discussing what the reader does, it is important to discuss a few data
# types which are provided by a lisp.

A few Lisp data types are of particular importance, both because they are
relatively rare in other languages, but also because they are very widespread in
Lisp code, i.e. the reader often creates them.

Every Lisp dialect the author is aware of provides at least the following:

*** Symbols
The symbol is a type, which represents a name, often together with places for
values and/or functions.  The latter depend on the Lisp dialect.  An important
property of symbols is that fast lookup is supported, and that symbols are
interned.  This means that each symbol which is read, which has the same name,
returns the same Lisp object.[fn:: This is, in effect, a singleton.]

In {{{el}}}, which is the Lisp under consideration for this thesis, a symbol has
the following attributes:

- Name :: A (typically hashed) name for the symbol.  This may be retrieved as a
     string at any time.
- Value :: This is the value of the symbol.  It may be retrieved by a call to
     {{{fun(symbol-value)}}} or by simply appearing in a program (macros or
     special forms may treat symbols differently).
- Function :: This cell is looked up if the symbol is the first element of a
     list which is evaluated (more on this later).  Alternatively, a call to
     {{{fun(symbol-function)}}} returns the function to which it points (if
     any). \todo{place a reference}
- Property List :: A symbol may also have a Property List, or plist for short,
     which is a mapping from a key (mostly a symbol) to a value.  This is
     intended as a mechanism to store arbitrary metadata in a symbol.

*** List
In Lisp parlance, when a list is mentioned, it is almost always a singly linked
list.  While by far not the only compound data structure[fn:: Strictly speaking,
lists by themselves to not exist: there are only cons-cells, yet this nuance is
not very important for the current discussion.], it is a very important one.

Not only is there syntax for lists---in the form of parentheses---together with
the symbol, the list is used as the prime representation for code.  The
following section hat some examples, as it discusses the result of calling the
reader.

** Reader, Compiler, Interpreter
In this section, an overview over the reader, compiler and interpreter is given,
as it is relevant to the central point of the thesis.

*** What does a reader do?
In a sense, every programming language has a reader.  Every language
implementation must provide some means of converting characters in source code
into data structures which are more meaningful to the later stages of
interpretation or compilation.

The difference in Lisp is that the reader is available to the programmer both at
runtime and compile time (if there is a compile phase).

This means, that an application may store data structures by printing them (for
instance to a file) and later reading them back.  If one had a list, containing
the symbol {{{sym(foo)}}}, the number 3, the symbol {{{sym(bar)}}} and the
string ``4'', printing might result in this: [fn:: The exact form depends on the
dialect.  If not otherwise stated, {{{el}}} is assumed.  {{{cl}}} is also used
extensively.]

#+BEGIN_SRC emacs-lisp
  (foo 3 bar "4")
#+END_SRC

This may later be read back with a call to {{{fun(read)}}}, to retrieve a data
structure, which has the same shape as the original.  Note that this is not
syntax for code in the sense of execution, yet merely for data.  This is an idea
which pervades Lisp, as code is data, and data may be code.

If the code which was read in this example were to be evaluated (by calling
{{{fun(eval)}}} on the result of the call to {{{fun(read)}}}), {{{sym(foo)}}}
would be expected to name a function, and {{{sym(bar)}}} would be evaluated.
The function named by {{{sym(foo)}}}, if any, would then be called with the
argument 3, whatever {{{sym(bar)}}} evaluated to, and the string ``4''.

The strict distinction between reading code, and evaluating code is what makes
reader macros possible.  It is also the reason for the parenthesis in typical
lisp code.  This is because the list (denoted by parenthesis) is the structure
in which code is held.  This is true for assignments, function calls, function
definitions etc.  Examples are given below.

**** Assignment
An assignment is either a macro (which expands to code), or a special form,
i.e. a primitive which the implementation must provide.  Here a special form was
chosen.  The value of the expression marked as {{{sym(value)}}} will be assigned
to the place noted by the symbol {{{sym(variablename)}}}.  In most cases, the
variable name must be quoted, i.e. be preserved as a symbol, instead of being
evaluated.

#+BEGIN_SRC emacs-lisp
  (set 'variablename value)
#+END_SRC

* COMMENT Appendix
#+ATTR_LATEX: :options linenos=true,fontsize=\footnotesize,firstline=37,firstnumber=37
#+INCLUDE: "~/code/el-reader/el-reader.el" src emacs-lisp
* References
  - srfi-10 :: http://srfi.schemers.org/srfi-10/srfi-10.html
  - dynamic scope misnomer :: http://www.cs.cmu.edu/Groups/AI/html/cltl/clm/node43.html
