thesis.tex

\subsection{Important Lisp Data Types}
\label{sec:orgheadline13}
A few Lisp data types are of particular importance, both because they are
relatively rare in other languages, but also because they are very widespread in
Lisp code, i.e. the reader often creates them.

Every Lisp dialect the author is aware of provides at least the following:

\subsubsection{Symbols}
\label{sec:orgheadline11}
The symbol is a type, which represents a name, often together with places for
values and/or functions.  The latter depend on the Lisp dialect.  An important
property of symbols is that fast lookup is supported, and that symbols are
interned.  This means that each symbol which is read, which has the same name,
returns the same Lisp object.\footnote{This is, in effect, a singleton.}

In Emacs Lisp, which is the Lisp under consideration for this thesis, a symbol has
the following attributes:

\begin{description}
\item[{Name}] A (typically hashed) name for the symbol.  This may be retrieved as a
string at any time.
\item[{Value}] This is the value of the symbol.  It may be retrieved by a call to
\texttt{symbol-value} or by simply appearing in a program (macros or
special forms may treat symbols differently).
\item[{Function}] This cell is looked up if the symbol is the first element of a
list which is evaluated (more on this later).  Alternatively, a call to
\texttt{symbol-function} returns the function to which it points (if
any). \todo{place a reference}
\item[{Property List}] A symbol may also have a Property List, or plist for short,
which is a mapping from a key (mostly a symbol) to a value.  This is
intended as a mechanism to store arbitrary metadata in a symbol.
\end{description}

\subsubsection{List}
\label{sec:orgheadline12}
In Lisp parlance, when a list is mentioned, it is almost always a singly linked
list.  While by far not the only compound data structure\footnote{Strictly speaking,
lists by themselves to not exist: there are only cons-cells, yet this nuance is
not very important for the current discussion.}, it is a very important one.

Not only is there syntax for lists---in the form of parentheses---together with
the symbol, the list is used as the prime representation for code.  The
following section hat some examples, as it discusses the result of calling the
reader.

\subsection{Reader, Compiler, Interpreter}
\label{sec:orgheadline16}
In this section, an overview over the reader, compiler and interpreter is given,
as it is relevant to the central point of the thesis.

\subsubsection{What does a reader do?}
\label{sec:orgheadline15}
In a sense, every programming language has a reader.  Every language
implementation must provide some means of converting characters in source code
into data structures which are more meaningful to the later stages of
interpretation or compilation.

The difference in Lisp is that the reader is available to the programmer both at
runtime and compile time (if there is a compile phase).

This means, that an application may store data structures by printing them (for
instance to a file) and later reading them back.  If one had a list, containing
the symbol \texttt{foo}, the number 3, the symbol \texttt{bar} and the
string ``4'', printing might result in this: \footnote{The exact form depends on the
dialect.  If not otherwise stated, Emacs Lisp is assumed.  Common Lisp is also used
extensively.}

\begin{minted}[]{common-lisp}
(foo 3 bar "4")
\end{minted}

This may later be read back with a call to \texttt{read}, to retrieve a data
structure, which has the same shape as the original.  Note that this is not
syntax for code in the sense of execution, yet merely for data.  This is an idea
which pervades Lisp, as code is data, and data may be code.

If the code which was read in this example were to be evaluated (by calling
\texttt{eval} on the result of the call to \texttt{read}), \texttt{foo}
would be expected to name a function, and \texttt{bar} would be evaluated.
The function named by \texttt{foo}, if any, would then be called with the
argument 3, whatever \texttt{bar} evaluated to, and the string ``4''.

The strict distinction between reading code, and evaluating code is what makes
reader macros possible.  It is also the reason for the parenthesis in typical
lisp code.  This is because the list (denoted by parenthesis) is the structure
in which code is held.  This is true for assignments, function calls, function
definitions etc.  Examples are given below.

\begin{enumerate}
\item Assignment
\label{sec:orgheadline14}
An assignment is either a macro (which expands to code), or a special form,
i.e. a primitive which the implementation must provide.  Here a special form was
chosen.  The value of the expression marked as \texttt{value} will be assigned
to the place noted by the symbol \texttt{variablename}.  In most cases, the
variable name must be quoted, i.e. be preserved as a symbol, instead of being
evaluated.

\begin{minted}[]{common-lisp}
(set 'variablename value)
\end{minted}
\end{enumerate}

\section{References}
\label{sec:orgheadline18}
\begin{description}
\item[{srfi-10}] \url{http://srfi.schemers.org/srfi-10/srfi-10.html}
\item[{dynamic scope misnomer}] \url{http://www.cs.cmu.edu/Groups/AI/html/cltl/clm/node43.html}
\end{description}
\end{document}